# Задача 2. Задан массив из случайных цифр на 15 элементов. На вход подаётся трёхзначное натуральное число.
# Напишите программу, которая определяет, есть в массиве последовательность из трёх элементов, совпадающая с введённым числом.
# [0, 5, 6, 2, 7, 7, 8, 1, 1, 9] - 277 -> да
# [4, 4, 3, 6, 7, 0, 8, 5, 1, 2] - 812 -> нет

import random


print("Семинар 6. Задача 2")

number = int(input("Количество чисел: "))

lst = list(random.randint(1, 10) for _ in range(number))
print(lst)
print(list(filter(lambda x: x > 5, lst)))
